Show / Hide Table of Contents
Class CrossSectionGeneralColdFormed
Creates one item cross-section of general cold formed profile defined by it´s center line
Inheritance
System.Object
OpenObject
OpenElementId
CrossSection
CrossSectionGeneralColdFormed
Inherited Members
 CrossSection.Name
 CrossSection.CrossSectionRotation
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.CrossSection.CrossSection,CI.CrossSection", "CI.StructModel.Libraries.CrossSection.ICrossSection,CI.BasicTypes", typeof(CrossSection))]
public class CrossSectionGeneralColdFormed : CrossSection
Constructors
Improve this Doc   View Source
CrossSectionGeneralColdFormed()
Constructor
Declaration
public CrossSectionGeneralColdFormed()
Properties
Improve this Doc   View Source
Centerline
Centerline of cross-section made from linear segments
Declaration
public PolyLine2D Centerline { get; set; }
Property Value
 Type |  Description
 PolyLine2D
Improve this Doc   View Source
CrossSectionType
Type of cross-section
Declaration
public CrossSectionType CrossSectionType { get; set; }
Property Value
 Type |  Description
 CrossSectionType
Improve this Doc   View Source
Material
Material of cross-section
Declaration
public ReferenceElement Material { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Radius
Inner rounding radius between linear segments of centerline
Declaration
public double Radius { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Thickness
Thickness of thin wall cross-section
Declaration
public double Thickness { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source